airfoil/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 | 
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox 
   \    /   O peration     | Website:  https://openfoam.org 
    \  /    A nd           | Version:  6 
     \/     M anipulation  | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1; 

vertices
(
    (0.0 0.0 0)
    (21.0 -10.0 0)
    (1.874885892508946 -10.0 0)
    (0.0 -10.0 0)
    (-10.0 0.0 0)
    (0.0 10.0 0)
    (1.874885892508946 10.0 0)
    (21.0 10.0 0)
    (21.0 0.1 0)
    (21.0 0.0 0)
    (21.0 -0.1 0)
    (1.015837558228311 0.09873789419146461 0)
    (1.0 0.0 0)
    (1.015837558228311 -0.09873789419146461 0)
    (0.24850016872152866 0.17425875189808163 0)
    (0.25 0.07427 0)
    (0.25 -0.07427 0)
    (0.25149983127847136 -0.17425875189808163 0)
    (-0.1 0.0 0)
    (0.0 0.0 1)
    (21.0 -10.0 1)
    (1.874885892508946 -10.0 1)
    (0.0 -10.0 1)
    (-10.0 0.0 1)
    (0.0 10.0 1)
    (1.874885892508946 10.0 1)
    (21.0 10.0 1)
    (21.0 0.1 1)
    (21.0 0.0 1)
    (21.0 -0.1 1)
    (1.015837558228311 0.09873789419146461 1)
    (1.0 0.0 1)
    (1.015837558228311 -0.09873789419146461 1)
    (0.24850016872152866 0.17425875189808163 1)
    (0.25 0.07427 1)
    (0.25 -0.07427 1)
    (0.25149983127847136 -0.17425875189808163 1)
    (-0.1 0.0 1)
);

blocks
(
    hex (2 1 10 13 21 20 29 32) (188 133 1) simpleGrading (166.91557906199472 13.267107276604163 13.267107276604163 166.91557906199472 0.020271356475901545 0.020271356475901545 0.020271356475901545 0.020271356475901545 1 1 1 1) 
    hex (3 2 13 17 22 21 32 36) (56 133 1) simpleGrading (0.023513315044603748 8.9076296979454 8.9076296979454 0.023513315044603748 0.020412306314237436 0.020271356475901545 0.020271356475901545 0.020412306314237436 1 1 1 1) 
    hex (4 3 17 18 23 22 36 37) (52 133 1) edgeGrading (0.25 0.5 0.5 0.25 0.020271356475901545 0.020412306314237436 0.020412306314237436 0.020271356475901545 1 1 1 1) 
    hex (4 18 14 5 23 37 33 24) (133 52 1) edgeGrading (0.020271356475901545 0.020412514775760896 0.020412514775760896 0.020271356475901545 0.25 0.5 0.5 0.25 1 1 1 1) 
    hex (14 11 6 5 33 30 25 24) (49 133 1) edgeGrading (7.443017609037111 0.023513315044603748 0.023513315044603748 7.443017609037111 48.989554250682666 49.33068989185767 49.33068989185767 48.989554250682666 1 1 1 1) 
    hex (11 8 7 6 30 27 26 25) (188 133 1) simpleGrading (13.267107276604163 166.91557906199472 166.91557906199472 13.267107276604163 49.33068989185767 49.33068989185767 49.33068989185767 49.33068989185767 1 1 1 1) 
    hex (12 9 8 11 31 28 27 30) (188 37 1) simpleGrading (13.267107276604163 6.081406942770463 1) 
    hex (15 12 11 14 34 31 30 33) (49 37 1) egeeGrading (4.3 7.443017609037111 7.443017609037111 4.3 6.081406942770463 6.081406942770463 6.081406942770463 6.081406942770463 1 1 1 1) 
    hex (0 15 14 18 19 34 33 37) (52 37 1) edgeGrading (2 0.5 0.5 2 6.081406942770463 6.081406942770463 6.081406942770463 6.081406942770463 1 1 1 1) 
    hex (18 17 16 0 37 36 35 19) (52 37 1) edgeGrading (0.5 2 2 0.5 0.16443563297285893 0.16443563297285893 0.16443563297285893 0.16443563297285893 1 1 1 1) 
    hex (17 13 12 16 36 32 31 35) (56 37 1) edgeGrading (8.9076296979454 4.3 4.3 8.9076296979454 0.16443563297285893 0.16443563297285893 0.16443563297285893 0.16443563297285893 1 1 1 1) 
    hex (13 10 9 12 32 29 28 31) (188 37 1) simpleGrading (13.267107276604163 0.16443563297285893 1) 
);

edges
(
    polyLine 11 14
    (
        (0.9658375582283109 0.1088178941914646 0)
        (0.9149694079521817 0.11697323614386838 0)
        (0.8137190439592765 0.13184446902004693 0)
        (0.7120368426334205 0.14507292893542667 0)
        (0.6101325808199173 0.156525329601544 0)
        (0.5077268301023139 0.1658710335782432 0)
        (0.4044206741384137 0.1724422404161286 0)
        (0.3011532566340665 0.17501334977455243 0)
    )
    polyLine 30 33
    (
        (0.9658375582283109 0.1088178941914646 1)
        (0.9149694079521817 0.11697323614386838 1)
        (0.8137190439592765 0.13184446902004693 1)
        (0.7120368426334205 0.14507292893542667 1)
        (0.6101325808199173 0.156525329601544 1)
        (0.5077268301023139 0.1658710335782432 1)
        (0.4044206741384137 0.1724422404161286 1)
        (0.3011532566340665 0.17501334977455243 1)
    )
    polyLine 14 18
    (
        (0.19257058901514504 0.1714436373806036 0)
        (0.13692326150252745 0.16596130778978418 0)
        (0.08124546000361493 0.15675559355648605 0)
        (0.04785855551873325 0.1487462570257686 0)
        (0.013149616349837544 0.13739262272997593 0)
        (-0.023433501628697943 0.12016826161253243 0)
        (-0.06692474446305142 0.08442944343868683 0)
        (-0.08842690662701126 0.046697774940331255 0)
    )
    polyLine 33 37
    (
        (0.19257058901514504 0.1714436373806036 1)
        (0.13692326150252745 0.16596130778978418 1)
        (0.08124546000361493 0.15675559355648605 1)
        (0.04785855551873325 0.1487462570257686 1)
        (0.013149616349837544 0.13739262272997593 1)
        (-0.023433501628697943 0.12016826161253243 1)
        (-0.06692474446305142 0.08442944343868683 1)
        (-0.08842690662701126 0.046697774940331255 1)
    )
    polyLine 18 17
    (
        (-0.04597320560258668 -0.10479264928216797 0)
        (-0.023433501628697943 -0.12016826161253243 0)
        (0.013149616349837544 -0.13739262272997593 0)
        (0.04785855551873325 -0.1487462570257686 0)
        (0.08124546000361493 -0.15675559355648605 0)
        (0.13692326150252745 -0.16596130778978418 0)
        (0.19257058901514504 -0.1714436373806036 0)
    )
    polyLine 37 36
    (
        (-0.04597320560258668 -0.10479264928216797 1)
        (-0.023433501628697943 -0.12016826161253243 1)
        (0.013149616349837544 -0.13739262272997593 1)
        (0.04785855551873325 -0.1487462570257686 1)
        (0.08124546000361493 -0.15675559355648605 1)
        (0.13692326150252745 -0.16596130778978418 1)
        (0.19257058901514504 -0.1714436373806036 1)
    )
    polyLine 17 13
    (
        (0.3011532566340665 -0.17501334977455243 0)
        (0.4044206741384137 -0.1724422404161286 0)
        (0.5077268301023139 -0.1658710335782432 0)
        (0.6101325808199173 -0.156525329601544 0)
        (0.7120368426334205 -0.14507292893542667 0)
        (0.8137190439592765 -0.13184446902004693 0)
        (0.9149694079521817 -0.11697323614386838 0)
        (0.9658375582283109 -0.1088178941914646 0)
    )
    polyLine 36 32
    (
        (0.3011532566340665 -0.17501334977455243 1)
        (0.4044206741384137 -0.1724422404161286 1)
        (0.5077268301023139 -0.1658710335782432 1)
        (0.6101325808199173 -0.156525329601544 1)
        (0.7120368426334205 -0.14507292893542667 1)
        (0.8137190439592765 -0.13184446902004693 1)
        (0.9149694079521817 -0.11697323614386838 1)
        (0.9658375582283109 -0.1088178941914646 1)
    )
    spline 12 15
    (
        (0.95 0.01008 0)
        (0.9 0.0181 0)
        (0.8 0.03279 0)
        (0.7 0.0458 0)
        (0.6 0.05704 0)
        (0.5 0.06617 0)
        (0.4 0.07254 0)
        (0.3 0.07502 0)
    )
    spline 31 34
    (
        (0.95 0.01008 1)
        (0.9 0.0181 1)
        (0.8 0.03279 1)
        (0.7 0.0458 1)
        (0.6 0.05704 1)
        (0.5 0.06617 1)
        (0.4 0.07254 1)
        (0.3 0.07502 1)
    )
    arc 4 5 (-7.071072502792263 7.071063120935576 0)
    arc 3 4 (-7.071072502792263 -7.071063120935576 0)
    arc 23 24 (-7.071072502792263 7.071063120935576 1)
    arc 22 23 (-7.071072502792263 -7.071063120935576 1)
    spline 15 0
    (
        (0.2 0.07172 0)
        (0.15 0.06682 0)
        (0.1 0.05853 0)
        (0.075 0.0525 0)
        (0.05 0.04443 0)
        (0.025 0.03268 0)
        (0.0125 0.02367 0)
        (0.0 0.0 0)
    )
    spline 34 19
    (
        (0.2 0.07172 1)
        (0.15 0.06682 1)
        (0.1 0.05853 1)
        (0.075 0.0525 1)
        (0.05 0.04443 1)
        (0.025 0.03268 1)
        (0.0125 0.02367 1)
        (0.0 0.0 1)
    )
    spline 0 16
    (
        (0.0125 -0.02367 0)
        (0.025 -0.03268 0)
        (0.05 -0.04443 0)
        (0.075 -0.0525 0)
        (0.1 -0.05853 0)
        (0.15 -0.06682 0)
        (0.2 -0.07172 0)
    )
    spline 19 35
    (
        (0.0125 -0.02367 1)
        (0.025 -0.03268 1)
        (0.05 -0.04443 1)
        (0.075 -0.0525 1)
        (0.1 -0.05853 1)
        (0.15 -0.06682 1)
        (0.2 -0.07172 1)
    )
    spline 16 12
    (
        (0.3 -0.07502 0)
        (0.4 -0.07254 0)
        (0.5 -0.06617 0)
        (0.6 -0.05704 0)
        (0.7 -0.0458 0)
        (0.8 -0.03279 0)
        (0.9 -0.0181 0)
        (0.95 -0.01008 0)
    )
    spline 35 31
    (
        (0.3 -0.07502 1)
        (0.4 -0.07254 1)
        (0.5 -0.06617 1)
        (0.6 -0.05704 1)
        (0.7 -0.0458 1)
        (0.8 -0.03279 1)
        (0.9 -0.0181 1)
        (0.95 -0.01008 1)
    )
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          (1 2 13 10)
          (2 3 17 13)
          (3 4 18 17)
          (18 4 5 14)
          (11 14 5 6)
          (8 11 6 7)
          (9 12 11 8)
          (12 15 14 11)
          (0 18 14 15)
          (17 18 0 16)
          (13 17 16 12)
          (10 13 12 9)
          (21 20 29 32)
          (22 21 32 36)
          (23 22 36 37)
          (23 37 33 24)
          (33 30 25 24)
          (30 27 26 25)
          (31 28 27 30)
          (34 31 30 33)
          (37 19 34 33)
          (37 36 35 19)
          (36 32 31 35)
          (32 29 28 31)
         );
     }
    farfield
    {
        type patch;
        faces
        (
          (4 23 24 5)
          (5 24 25 6)
          (6 25 26 7)
          (27 8 7 26)
          (28 9 8 27)
          (29 10 9 28)
          (20 1 10 29)
          (21 2 1 20)
          (22 3 2 21)
          (23 4 3 22)
         );
     }
    airfoil
    {
        type wall;
        faces
        (
          (34 15 12 31)
          (19 0 15 34)
          (0 19 35 16)
          (16 35 31 12)
         );
     }
);
